Tasks/ИзменениеСтатусаГЧ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Task>
		<Properties>
			<Name>ИзменениеСтатусаГЧ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГабаритныйЧертеж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГабаритныеЧертежи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КрайняяДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыйСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗамера</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ПроверитьГабаритныеЧертежи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусИзменен</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадачКонструирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяГруппыДляОтображения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Наблюдатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наблюдатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<AddressingAttribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

Tasks/ИзменениеСтатусаГЧ/Forms/ФормаЗадачи/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.СтатусИзменен = 0 Тогда
	
		Отказ = Истина; 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не указано действие";
		Сообщение.Поле = "СтатусИзменен";
		Сообщение.ПутьКДанным = "Объект";
		Сообщение.Сообщить();
		

	ИначеЕсли Объект.СтатусИзменен = 2 Тогда
		Если ЗначениеЗаполнено(ИсполнительДоработки) Тогда
			
			Объект.ДополнительныеДанные.Очистить();
			
			НС = Объект.ДополнительныеДанные.Добавить();
			НС.Наименование = "ИсправитьПрользователь";
			НС.Значение = ИсполнительДоработки;
			
			НС = Объект.ДополнительныеДанные.Добавить();
			НС.Наименование = "ИсправитьКомментарий";
			НС.Значение = КомментарийДоработки;
			
			НС = Объект.ДополнительныеДанные.Добавить();
			НС.Наименование = "КрайняяДатаИсполнения";
			НС.Значение = КрайняяДатаДоработки;
			
		Иначе
			
			Отказ = Истина;
			ПоказатьПредупреждение(,"Не указан исполнитель доработки");			
			
		КонецЕсли;
	Иначе
		Объект.ДополнительныеДанные.Очистить();
	КонецЕсли;
	
	Если НЕ (Отказ ИЛИ Объект.Выполнена) Тогда
		
		Элементы.ВыполнитьЗадачу.Доступность 				= Истина;	
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередВыполнением(Отказ)
	
	Если Объект.СтатусИзменен = 0 Тогда
	
		Отказ = Истина;
		ПоказатьПредупреждение(,"Не выбран статус");
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ИзменениеЗамеров");
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусИзмененПриИзменении(Элемент)
	
	Если Объект.СтатусИзменен = 2 Тогда
		
		Элементы.ГруппаДоработка.Видимость = Истина;	
	
	Иначе
	
		Элементы.ГруппаДоработка.Видимость = Ложь;	
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Для каждого х Из  Объект.ДополнительныеДанные Цикл
		
		Если х.Наименование = "ИсправитьПрользователь" Тогда
			
			ИсполнительДоработки = х.Значение;
			
		ИначеЕсли х.Наименование = "ИсправитьКомментарий" Тогда
			
			КомментарийДоработки = х.Значение;
			
		ИначеЕсли х.Наименование = "КрайняяДатаИсполнения" Тогда
			
			КрайняяДатаДоработки = х.Значение;
			
		КонецЕсли;	
		
	КонецЦикла; 
	
	СтатусИзмененПриИзменении(Неопределено); 
	
	Если Параметры.Ключ.Пустая() ИЛИ Объект.Выполнена Тогда
	
		Элементы.ВыполнитьЗадачу.Доступность 				= Ложь;	
	
	КонецЕсли; 
	
	ТолькоПросмотр 									= Объект.Выполнена;
	Элементы.ФормаЗаписатьЗадачу.Доступность 		= НЕ ТолькоПросмотр;	
	Элементы.ДекорацияЗадачаВыполнена.Видимость 	= ТолькоПросмотр;	
	
КонецПроцедуры     

&НаКлиенте
Процедура ЗаписатьЗадачу(Команда)
	Записать();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗадачу(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.НовыйСтатус) Тогда
	
		ПоказатьПредупреждение(, "Не обходимо заполнить новый статус!");
		Возврат;
	
	КонецЕсли;
	
	Если Модифицированность Тогда	
		Записать(); 
	КонецЕсли;
	
	ЗаписатьВыполнениеНаСервере();
	
	Закрыть();
КонецПроцедуры  

&НаСервере
Процедура ЗаписатьВыполнениеНаСервере()
	
	ЗадачаОбъект = Объект.Ссылка.ПолучитьОбъект();
	ЗадачаОбъект.ВыполнитьЗадачу();
	
КонецПроцедуры // ЗапмсатьВыполнениеНаСервере()  

&НаКлиенте
Процедура ЗадачуРКДВОжидание(Команда)
	ЗадачуРКДВОжиданиеНаСервере();
КонецПроцедуры                    

Процедура ЗадачуРКДВОжиданиеНаСервере()
	
	об = РеквизитФормыВЗначение("Объект");
	об.ПеревестиЗадачуРКДВОжидание(); 

КонецПроцедуры

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ Строка(ПараметрыСеанса.ТекущийПользователь) = "Программист" Тогда
	
		Элементы.ПеревестиЗадачуРКДВОжидание.Видимость = Ложь;	
	
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПроектНаСервере(ГабаритныйЧертеж)
	
	СтруктурвВзврата = Новый Структура("Проект, Наименование", Справочники.Проекты.ПустаяСсылка(), "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГабаритныеЧертежи.Наименование КАК Наименование,
		|	ГабаритныеЧертежи.Проект КАК Проект
		|ИЗ
		|	Справочник.ГабаритныеЧертежи КАК ГабаритныеЧертежи
		|ГДЕ
		|	ГабаритныеЧертежи.Ссылка = &ГабаритныйЧертеж";
	
	Запрос.УстановитьПараметр("ГабаритныйЧертеж", ГабаритныйЧертеж);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктурвВзврата, Выборка);
	КонецЦикла;

	Возврат СтруктурвВзврата
	
КонецФункции

&НаКлиенте
Процедура ГабаритныйЧертежПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ГабаритныйЧертеж) Тогда
		
		СтруктурвВзврата 	= ПолучитьПроектНаСервере(Объект.ГабаритныйЧертеж);
		Объект.Наименование = СтруктурвВзврата.Наименование;
		Объект.Проект 		= СтруктурвВзврата.Проект;
		
	Иначе
	
		Объект.Наименование = "";
		Объект.Проект 		= ПредопределенноеЗначение("Справочник.Проекты.ПустаяСсылка");
	
	КонецЕсли;
КонецПроцедуры
